Revit 2024 API
FormulaEditingEventArgs.CurrentDocument Property
 Returns the current document
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Document CurrentDocument { get; }
Visual Basic
Public ReadOnly Property CurrentDocument As Document
	Get
Visual C++
public:
property Document^ CurrentDocument {
	Document^ get ();
}
See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace